Tekla Open API Reference for Tekla Structures 2025
RebarItem.MAIN_USAGE Field
 The main usage string.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const string MAIN_USAGE = "main"
Public Const MAIN_USAGE As String = "main"
Field Value
Type: String
See Also
Reference
RebarItem Class
Tekla.Structures.Catalogs Namespace